---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsHookBend
source: html/fa6154ad-8803-451c-498a-d762ea9f51e8.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsHookBend Method

Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'.

## Syntax (C#)
```csharp
public bool TargetIsHookBend()
```